{
  "posts": [
    {
      "title": "Prada & Oakley Design Next-Gen Spacesuit for NASA's Artemis III",
      "date": "2025-07-19T22:00:00.000Z",
      "category": "fashion",
      "cover": "static/uploads/oakley-_-prada.webp",
      "excerpt": "Prada and Oakley join forces with Axiom Space to design NASA’s Artemis III spacesuit — blending cutting-edge safety, innovation, and luxury design for a historic Moon mission in 2026.",
      "body": " <p><strong>Prada</strong> and <strong>Oakley</strong> have partnered with <strong>Axiom Space</strong> to create the next-generation spacesuit for NASA’s upcoming <strong>Artemis III</strong> mission — which will send the first woman, person of color, and non-American to the Moon’s south pole. 🪡</p>\n        <p>Prada contributed its expertise in high-performance materials and precision design to develop a suit that is durable, functional, and visually striking. Meanwhile, Oakley is crafting advanced visors with enhanced optics and protection, ensuring astronauts have unparalleled visibility and safety in one of the harshest environments imaginable.</p>\n        <p>The result is a technologically advanced suit that merges safety, innovation, and fashion — a bold statement on how style can exist even in space. Every seam, material choice, and design detail serves a purpose, balancing form and function with astronaut mobility and comfort.</p>\n        <p>Set to be ready for the 2026 mission, the suit symbolizes how cross-industry collaboration can push human boundaries. It’s not just a leap forward for space exploration — it’s a cultural moment that unites science, technology, and luxury design under one mission: to make history on the Moon.</p>\n"
    },
    {
      "date": "2025-07-20T17:38:24.403Z",
      "cover": "static/uploads/lv-puffer-v2.webp",
      "category": "fashion",
      "title": "Pharrell's SS26 Louis Vuitton Puffer: A Statement Piece",
      "body": "<p>I know and you know — this is probably a favourite piece from the <strong>Louis Vuitton</strong> SS26 collection. 🪡</p>\n        <p>The standout? A rich green puffer jacket from the SS26 runway, part of Louis Vuitton’s <em>“glamping”</em>-inspired collection designed by <strong>Pharrell Williams</strong>. The piece blends luxury craftsmanship with outdoor-ready utility, making it both a style statement and a functional garment.</p>\n        <p>Pharrell’s vision for the collection plays with contrasts — opulent textures meet rugged silhouettes, while earthy tones balance the brand’s signature refinement. The green puffer exemplifies this ethos, pairing exaggerated proportions with intricate detailing that rewards a closer look.</p>\n        <p>From front row whispers at <strong>#ParisFashionWeek</strong> to social media buzz, this jacket has quickly become the piece everyone’s talking about. Whether you see it as high-fashion art or an elevated winter essential, one thing’s certain: Pharrell’s Louis Vuitton is still rewriting the rules.</p>\n        <p>—<br>\n        cc: <a href=\"https://instagram.com/LouisVuitton\" target=\"_blank\" rel=\"noopener\">@LouisVuitton</a><br>\n        #ParisFashionWeek #PFW</p>",
      "excerpt": "Pharrell Williams makes a bold statement with his SS26 LV puffer jacket design. This article explores the design philosophy and cultural impact of this iconic piece."
    }
  ]
}