{
  "posts": [
    {
      "title": "Prada & Oakley Design Next-Gen Spacesuit for NASA's Artemis III",
      "date": "2025-07-19T22:00:00.000Z",
      "category": "fashion",
      "cover": "static/uploads/oakley-_-prada.webp",
      "excerpt": "Prada and Oakley join forces with Axiom Space to design NASA’s Artemis III spacesuit — blending cutting-edge safety, innovation, and luxury design for a historic Moon mission in 2026.",
      "body": " <p><strong>Prada</strong> and <strong>Oakley</strong> have partnered with <strong>Axiom Space</strong> to create the next-generation spacesuit for NASA’s upcoming <strong>Artemis III</strong> mission — which will send the first woman, person of color, and non-American to the Moon’s south pole. 🪡</p>\n        <p>Prada contributed its expertise in high-performance materials and precision design to develop a suit that is durable, functional, and visually striking. Meanwhile, Oakley is crafting advanced visors with enhanced optics and protection, ensuring astronauts have unparalleled visibility and safety in one of the harshest environments imaginable.</p>\n        <p>The result is a technologically advanced suit that merges safety, innovation, and fashion — a bold statement on how style can exist even in space. Every seam, material choice, and design detail serves a purpose, balancing form and function with astronaut mobility and comfort.</p>\n        <p>Set to be ready for the 2026 mission, the suit symbolizes how cross-industry collaboration can push human boundaries. It’s not just a leap forward for space exploration — it’s a cultural moment that unites science, technology, and luxury design under one mission: to make history on the Moon.</p>\n"
    },
    {
      "date": "2025-07-20T17:38:24.403Z",
      "cover": "static/uploads/lv-puffer-v2.webp",
      "category": "fashion",
      "title": "Pharrell's SS26 Louis Vuitton Puffer: A Statement Piece",
      "body": "<p>I know and you know — this is probably a favourite piece from the <strong>Louis Vuitton</strong> SS26 collection. 🪡</p>\n        <p>The standout? A rich green puffer jacket from the SS26 runway, part of Louis Vuitton’s <em>“glamping”</em>-inspired collection designed by <strong>Pharrell Williams</strong>. The piece blends luxury craftsmanship with outdoor-ready utility, making it both a style statement and a functional garment.</p>\n        <p>Pharrell’s vision for the collection plays with contrasts — opulent textures meet rugged silhouettes, while earthy tones balance the brand’s signature refinement. The green puffer exemplifies this ethos, pairing exaggerated proportions with intricate detailing that rewards a closer look.</p>\n        <p>From front row whispers at <strong>#ParisFashionWeek</strong> to social media buzz, this jacket has quickly become the piece everyone’s talking about. Whether you see it as high-fashion art or an elevated winter essential, one thing’s certain: Pharrell’s Louis Vuitton is still rewriting the rules.</p>\n        <p>—<br>\n        cc: <a href=\"https://instagram.com/LouisVuitton\" target=\"_blank\" rel=\"noopener\">@LouisVuitton</a><br>\n        #ParisFashionWeek #PFW</p>",
      "excerpt": "Pharrell Williams makes a bold statement with his SS26 LV puffer jacket design. This article explores the design philosophy and cultural impact of this iconic piece."
    },
    {
      "date": "2025-08-04T17:46:39.265Z",
      "title": "FC Barcelona x Kobe Bryant Brand: A Historic Collaboration",
      "cover": "static/uploads/fcb-x-kobe.webp",
      "category": "discourse",
      "body": "<p>Spanish champions, <strong>FC Barcelona</strong>, have announced a collaboration with the brand of their good friend, NBA legend <strong>Kobe Bryant</strong>.</p>\n\n<p>The collaboration reimagines team kits, blending Barça’s iconic colors with sleek design elements inspired by Kobe’s legacy. The collection features apparel as well as accessories, bringing together the worlds of basketball and football in a single, striking fashion statement. 🖇️</p>\n\n<p>This partnership goes beyond sportswear — it’s a tribute to Kobe’s competitive spirit and global influence. Every detail, from the placement of the crest to the use of premium fabrics, is meant to symbolize excellence and ambition, values shared by both FC Barcelona and Kobe’s brand.</p>\n\n<p>Collectors and fans can expect limited-edition drops, with some pieces designed to be future classics. From training jackets to streetwear-ready sneakers, the range offers something for both die-hard Barça supporters and Kobe fans worldwide. The collaboration is expected to debut in select flagship stores and online later this year.</p>",
      "excerpt": "An unprecedented collaboration brings together the worlds of football and basketball. This article explores the story behind the FC Barcelona and Kobe Bryant brand partnership."
    },
    {
      "date": "2025-07-28T18:01:38.474Z",
      "cover": "static/uploads/editors-edit.webp",
      "title": "Editor's Edit: Outlander Magazine for PUMA",
      "category": "fashion",
      "excerpt": "A deep dive into the stunning fashion collaboration between Outlander Magazine and Puma. We analyze the creative direction and style of this unique feature.",
      "body": "﻿<p>The <strong>‘Editor’s Edit’</strong> series — a space for ongoing discourse, built through the revision and response to opinions and arguments formed by other publications. 🗞️</p>\n\n<p>For our first edition, we look to <strong>Outlander Magazine</strong> (London), who recently gave flowers to <strong>Puma</strong> for consistently championing younger designers and smaller brands.</p>\n\n<p>We highlight how <strong>creative freedom</strong> has become Puma’s core language — an approach that has helped the brand flourish in both the fashion and sportswear spheres. By allowing collaborators to bring their own DNA into projects, Puma sidesteps the cookie-cutter approach and instead delivers collections that feel relevant, experimental, and culturally plugged-in.</p>\n\n<p>This commitment to collaboration has paid off: from limited-edition drops with underground creatives to reimagining archival pieces with fresh perspectives, Puma has kept its output unpredictable yet authentic. It’s a strategy that not only strengthens brand identity but also builds a community that feels seen, heard, and celebrated.</p>\n\n<p>In a landscape where global sportswear giants often play it safe, Puma’s willingness to share the stage — and let new voices lead the narrative — might just be its most powerful move yet.</p>"
    }
  ]
}